**Eleman İşlemleri**

In [10]:
import numpy as np
import pandas as pd

In [6]:
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

In [7]:
sozluk = {"var1":s1, "var2":s2, "var3":s3}

In [8]:
sozluk

{'var1': array([6, 4, 9, 4, 3]),
 'var2': array([1, 8, 4, 2, 8]),
 'var3': array([2, 4, 6, 3, 4])}

In [12]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     6     1     2
1     4     8     4
2     9     4     6
3     4     2     3
4     3     8     4

In [13]:
df[0:1]

   var1  var2  var3
0     6     1     2

In [14]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [17]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     6     1     2
b     4     8     4
c     9     4     6
d     4     2     3
e     3     8     4

In [19]:
df["c":"e"]

   var1  var2  var3
c     9     4     6
d     4     2     3
e     3     8     4

**Silme İşlemi Yapma**

In [22]:
df.drop("c", axis=0)

   var1  var2  var3
a     6     1     2
b     4     8     4
d     4     2     3
e     3     8     4

In [28]:
df

   var1  var2  var3
a     6     1     2
b     4     8     4
d     4     2     3
e     3     8     4

In [32]:
df.drop("a", axis=0, inplace = True) #Kalıcı olmasını sağlayan kod inplace=True
df

   var1  var2  var3
b     4     8     4
d     4     2     3
e     3     8     4

In [33]:
df

   var1  var2  var3
b     4     8     4
d     4     2     3
e     3     8     4

**Fancy Silme İşlemi**

In [34]:
l=["b","d"]

In [35]:
df.drop(l, axis=0)

   var1  var2  var3
e     3     8     4

In [36]:
df

   var1  var2  var3
b     4     8     4
d     4     2     3
e     3     8     4

**Degişkenler İçin**

In [37]:
"var1" in df

True

In [38]:
l = ["var1","var4","var2"]

In [39]:
for i in l :
    print(i in df)

True
False
True

In [40]:
df

   var1  var2  var3
b     4     8     4
d     4     2     3
e     3     8     4

In [41]:
df["var4"] = df["var1"] / df["var2"]

In [42]:
df

   var1  var2  var3   var4
b     4     8     4  0.500
d     4     2     3  2.000
e     3     8     4  0.375

**Değişken Silmek**

In [43]:
df.drop("var4", axis = 1)

   var1  var2  var3
b     4     8     4
d     4     2     3
e     3     8     4

In [44]:
df

   var1  var2  var3   var4
b     4     8     4  0.500
d     4     2     3  2.000
e     3     8     4  0.375

In [45]:
df.drop("var4",axis=1, inplace=True)
df

   var1  var2  var3
b     4     8     4
d     4     2     3
e     3     8     4

In [46]:
df

   var1  var2  var3
b     4     8     4
d     4     2     3
e     3     8     4

In [47]:
l = ["var1","var2"]

In [48]:
df.drop(l, axis=1)

   var3
b     4
d     3
e     4